# StairsTriserNumberBaseIndex Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsTriserNumberBaseIndex Property
ParameterTypeId Class See Also
---
"Tread/Riser Start Number":
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsTriserNumberBaseIndex { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsTriserNumberBaseIndex As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsTriserNumberBaseIndex {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace